5) /home/florent/PhpstormProjects/web-push-php-ng/src/Utils.php:105    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $keyInfo = 'WebPush: info' . chr(0) . $userAgentPublicKey . $serverPublicKey;
         $prkKey = hash_hmac('sha256', $userAgentAuthToken, $sharedSecret, true);
-        return self::hkdf($userAgentAuthToken, $sharedSecret, $keyInfo, 32);
+        return self::hkdf($userAgentAuthToken, $sharedSecret, $keyInfo, 33);
     }
     public static function hkdf(string $salt, string $ikm, string $info, int $length) : string
     {

6) /home/florent/PhpstormProjects/web-push-php-ng/src/VAPID/VAPID.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $expirationTime = $this->expirationTime;
         return $this->cache->get($this->cacheKey, static function (ItemInterface $item) use($jwsProvider, $expirationTime) : Header {
             $expiresAt = new DateTimeImmutable($expirationTime);
-            $item->expiresAt($expiresAt);
+            
             return $jwsProvider->computeHeader($expiresAt);
         });
     }
 }

7) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:39    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->logger = new NullLogger();
         $this->eventDispatcher = new NullEventDispatcher();
     }
-    public function setLogger(LoggerInterface $logger) : self
+    protected function setLogger(LoggerInterface $logger) : self
     {
         $this->logger = $logger;
         return $this;

8) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->logger = $logger;
         return $this;
     }
-    public function setEventDispatcher(EventDispatcherInterface $eventDispatcher) : self
+    protected function setEventDispatcher(EventDispatcherInterface $eventDispatcher) : self
     {
         $this->eventDispatcher = $eventDispatcher;
         return $this;

9) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:53    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->eventDispatcher = $eventDispatcher;
         return $this;
     }
-    public function send(Notification $notification, Subscription $subscription) : void
+    protected function send(Notification $notification, Subscription $subscription) : void
     {
         $this->logger->debug('Sending notification', ['notification' => $notification, 'subscription' => $subscription]);
         $request = $this->requestFactory->createRequest('POST', $subscription->getEndpoint());

10) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function send(Notification $notification, Subscription $subscription) : void
     {
-        $this->logger->debug('Sending notification', ['notification' => $notification, 'subscription' => $subscription]);
+        
         $request = $this->requestFactory->createRequest('POST', $subscription->getEndpoint());
         $request = $this->extensionManager->process($request, $notification, $subscription);
         $this->logger->debug('Request ready', ['request' => $request]);

11) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function send(Notification $notification, Subscription $subscription) : void
     {
-        $this->logger->debug('Sending notification', ['notification' => $notification, 'subscription' => $subscription]);
+        $this->logger->debug('Sending notification', ['subscription' => $subscription]);
         $request = $this->requestFactory->createRequest('POST', $subscription->getEndpoint());
         $request = $this->extensionManager->process($request, $notification, $subscription);
         $this->logger->debug('Request ready', ['request' => $request]);

12) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->logger->debug('Sending notification', ['notification' => $notification, 'subscription' => $subscription]);
         $request = $this->requestFactory->createRequest('POST', $subscription->getEndpoint());
         $request = $this->extensionManager->process($request, $notification, $subscription);
-        $this->logger->debug('Request ready', ['request' => $request]);
+        
         $response = $this->client->sendRequest($request);
         $this->logger->debug('Response received', ['response' => $response]);
         if (200 === $response->getStatusCode()) {

13) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:58    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $this->logger->debug('Sending notification', ['notification' => $notification, 'subscription' => $subscription]);
         $request = $this->requestFactory->createRequest('POST', $subscription->getEndpoint());
         $request = $this->extensionManager->process($request, $notification, $subscription);
-        $this->logger->debug('Request ready', ['request' => $request]);
+        $this->logger->debug('Request ready', []);
         $response = $this->client->sendRequest($request);
         $this->logger->debug('Response received', ['response' => $response]);
         if (200 === $response->getStatusCode()) {

14) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:61    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $request = $this->extensionManager->process($request, $notification, $subscription);
         $this->logger->debug('Request ready', ['request' => $request]);
         $response = $this->client->sendRequest($request);
-        $this->logger->debug('Response received', ['response' => $response]);
+        $this->logger->debug('Response received', []);
         if (200 === $response->getStatusCode()) {
             $location = $response->getHeaderLine('location');
             $this->eventDispatcher->dispatch(new StatusReportSuccess($subscription, $notification, $location));

15) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $request = $this->extensionManager->process($request, $notification, $subscription);
         $this->logger->debug('Request ready', ['request' => $request]);
         $response = $this->client->sendRequest($request);
-        $this->logger->debug('Response received', ['response' => $response]);
+        
         if (200 === $response->getStatusCode()) {
             $location = $response->getHeaderLine('location');
             $this->eventDispatcher->dispatch(new StatusReportSuccess($subscription, $notification, $location));

16) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:62    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->logger->debug('Request ready', ['request' => $request]);
         $response = $this->client->sendRequest($request);
         $this->logger->debug('Response received', ['response' => $response]);
-        if (200 === $response->getStatusCode()) {
+        if (199 === $response->getStatusCode()) {
             $location = $response->getHeaderLine('location');
             $this->eventDispatcher->dispatch(new StatusReportSuccess($subscription, $notification, $location));
             return;

17) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:62    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->logger->debug('Request ready', ['request' => $request]);
         $response = $this->client->sendRequest($request);
         $this->logger->debug('Response received', ['response' => $response]);
-        if (200 === $response->getStatusCode()) {
+        if (201 === $response->getStatusCode()) {
             $location = $response->getHeaderLine('location');
             $this->eventDispatcher->dispatch(new StatusReportSuccess($subscription, $notification, $location));
             return;

18) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:62    [M] Identical

--- Original
+++ New
@@ @@
         $this->logger->debug('Request ready', ['request' => $request]);
         $response = $this->client->sendRequest($request);
         $this->logger->debug('Response received', ['response' => $response]);
-        if (200 === $response->getStatusCode()) {
+        if (200 !== $response->getStatusCode()) {
             $location = $response->getHeaderLine('location');
             $this->eventDispatcher->dispatch(new StatusReportSuccess($subscription, $notification, $location));
             return;

19) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->logger->debug('Response received', ['response' => $response]);
         if (200 === $response->getStatusCode()) {
             $location = $response->getHeaderLine('location');
-            $this->eventDispatcher->dispatch(new StatusReportSuccess($subscription, $notification, $location));
+            
             return;
         }
         $this->eventDispatcher->dispatch(new StatusReportFailure($subscription, $notification, $response->getStatusCode(), $response->getBody()->getContents()));
     }
 }

20) /home/florent/PhpstormProjects/web-push-php-ng/src/WebPush.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->eventDispatcher->dispatch(new StatusReportSuccess($subscription, $notification, $location));
             return;
         }
-        $this->eventDispatcher->dispatch(new StatusReportFailure($subscription, $notification, $response->getStatusCode(), $response->getBody()->getContents()));
+        
     }
 }
